"""
Задание 1.

Поработайте с переменными, создайте несколько, выведите на экран.
Запросите у пользователя некоторые числа и строки и сохраните в переменные,
затем выведите на экран.
"""
name = input("Enter your name: ")
password = input("Enter your password: ")
age = int(input("Enter your age: "))
print(f"Your login details: name - {name}, password - {password}, age - {age}")